{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "TRANSFER",
    "1": "HEALTHCARE",
    "2": "SALARY",
    "3": "SUBSCRIPTION",
    "4": "TRAVEL",
    "5": "ENTERTAINMENT",
    "6": "UTILITIES",
    "7": "FOOD",
    "8": "SHOPPING",
    "9": "CASH WITHDRAWAL",
    "10": "EMI",
    "11": "INVESTMENT"
  },
  "initializer_range": 0.02,
  "label2id": {
    "CASH WITHDRAWAL": 9,
    "EMI": 10,
    "ENTERTAINMENT": 5,
    "FOOD": 7,
    "HEALTHCARE": 1,
    "INVESTMENT": 11,
    "SALARY": 2,
    "SHOPPING": 8,
    "SUBSCRIPTION": 3,
    "TRANSFER": 0,
    "TRAVEL": 4,
    "UTILITIES": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
